ams2016/README/README.tex
% Created 2015-12-13 Sun 23:46
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{bigfoot}
\DeclareNewFootnote{URL}[arabic]
\renewcommand{\href}[2]{#2\footnoteURL{\url{#1}}}
\author{Julien Chastang}
\date{\textit{<2015-12-08 Tue>}}
\title{AMS 2016: UniCloud, Docker at Unidata\\\medskip
\large LDM, TDS, and RAMADDA on Microsoft Azure VM}
\hypersetup{
 pdfauthor={Julien Chastang},
 pdftitle={AMS 2016: UniCloud, Docker at Unidata},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.2)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Preamble}
\label{sec:orgheadline1}

The following instructions describe how to configure a \href{https://azure.microsoft.com}{Microsoft Azure VM} serving data with the \href{http://www.unidata.ucar.edu/software/ldm/}{LDM}, \href{http://www.unidata.ucar.edu/software/thredds/current/tds/}{TDS}, and \href{http://sourceforge.net/projects/ramadda/}{RAMADDA}. This document assumes you have access to Azure resources though these instructions should be fairly similar on other cloud providers (e.g., Amazon). They also assume familiarity with Unix, Docker, and Unidata technology in general. You will have to be comfortable entering command at the Unix command line. We will be using Docker images defined at the \href{https://github.com/Unidata/Unidata-Dockerfiles}{Unidata-Dockerfiles repository} in addition to a configuration specifically planned for AMS 2016 demonstrations  project \href{https://github.com/Unidata/Unidata-Dockerfiles/tree/master/ams2016}{AMS 2016 demonstrations  project}.
\section{Preliminary Setup on Azure}
\label{sec:orgheadline11}

The instructions assume we will create an Azure VM called \texttt{unidata-server.cloudapp.net} abbreviated to \texttt{unidata-server}. Tailor the VM name for your purposes when following this document. This VM will be our \textbf{Docker Host} from where we will run Docker containers for the LDM, TDS, and RAMADDA.

\subsection{\texttt{docker-machine}}
\label{sec:orgheadline2}

\href{https://docs.docker.com/machine/install-machine/}{Install} \texttt{docker-machine} on your local computer. \texttt{docker-machine} is a command line tool that gives users the ability to create Docker VMs on your local computer or on a cloud provider such as Azure.

\subsection{Create a VM on Azure.}
\label{sec:orgheadline3}

The following \texttt{docker-machine} command will create a Docker VM on Azure in which you will run various Docker containers. It will take a few minutes to run (between 5 and 10 minutes). You will have to supply \texttt{azure-subscription-id} and \texttt{azure-subscription-cert} path. See these Azure \texttt{docker-machine} \href{https://azure.microsoft.com/en-us/documentation/articles/virtual-machines-docker-machine/}{instructions}, if you have questions about this process.


\begin{verbatim}
docker-machine -D create -d azure \
               --azure-subscription-id="3.141" \
               --azure-subscription-cert="/path/to/mycert.pem" \
               --azure-size="ExtraLarge" unidata-server
\end{verbatim}

\subsection{Configure Unix Shell to Interact with New Azure VM.}
\label{sec:orgheadline4}

Execute the following command in your local computer shell environment.

\begin{verbatim}
eval "$(docker-machine env unidata-server)"
\end{verbatim}

\subsection{\texttt{ssh} into VM with \texttt{docker-machine}}
\label{sec:orgheadline5}

\begin{verbatim}
docker-machine ssh unidata-server
\end{verbatim}


\subsection{Install Package(s) with \texttt{apt-get}}
\label{sec:orgheadline6}

At the very least, we will need \texttt{unzip} on the Azure Docker host.

\begin{verbatim}
sudo apt-get -qq update
sudo apt-get -qq install unzip
\end{verbatim}
