ams2016/README/README.org
** Add =ubuntu= User to =docker= Group and Restart Docker

#+BEGIN_SRC sh :results verbatim drawer :exports code
  sudo usermod -G docker ubuntu
  sudo service docker restart
#+END_SRC

#+RESULTS:
:RESULTS:
docker stop/waiting
docker start/running, process 29917
:END:

** Restart Azure VM

At this point, we want to restart the VM to get a fresh start. This command may take a little while...

#+BEGIN_SRC sh :dir ~ :noweb yes :results verbatim drawer :exports code
  docker-machine restart <<myvm>>
  eval "$(docker-machine env <<myvm>>)"
#+END_SRC

#+RESULTS:
:RESULTS:
Restarted machines may have new IP addresses. You may need to re-run the `docker-machine env` command.
:END:

** =ssh= into VM

#+BEGIN_SRC sh :dir ~ :eval no :noweb yes
  docker-machine ssh <<myvm>>
#+END_SRC

** Install =docker-compose= on VM

 #+BEGIN_SRC org :noweb-ref dcompose-version :exports none
 1.5.2
 #+END_SRC

=docker-compose= is a tool for defining and running multi-container Docker applications. In our case, we will be running the LDM, TDS, TDM (THREDDS Data Manager) and RAMADDA so =docker-compose= is perfect for this scenario. Install =docker-compose= on the Azure Docker host.

 #+BEGIN_SRC org :noweb yes :results append :exports results
   "You may have to update version (currently at =<<dcompose-version>>=).
 #+END_SRC

 #+RESULTS:
 "You may have to update version (currently at =1.5.2=).

 #+BEGIN_SRC sh :noweb yes :results verbatim drawer :exports code
   curl -L \
  https://github.com/docker/compose/releases/download/<<dcompose-version>>/docker-compose-`uname -s`-`uname -m` \
        > docker-compose
   sudo mv docker-compose /usr/local/bin/
   sudo chmod +x /usr/local/bin/docker-compose
 #+END_SRC

 #+RESULTS:
 :RESULTS:
 :END:

* LDM and TDS Configuration
** Background

At this point, we have done the preliminary legwork to tackle the next step in this process. We will now want to clone two repositories that will allow us to configure and start running the the LDM, TDS, and RAMADDA. In particular, we will be cloning:

  - [[https://github.com/Unidata/Unidata-Dockerfiles][=github.com/Unidata/Unidata-Dockerfiles=]]  
  - [[https://github.com/Unidata/TdsConfig][=github.com/Unidata/TdsConfig=]] 

*** =Unidata-Dockerfiles=

The =Unidata-Dockerfiles= repository contains a number of Dockerfiles that pertain to various Unidata technologies (e.g., the LDM) and also projects (e.g., ams2016). As a matter of background information, a =Dockerfile= is a text file that contains commands to build a Docker image containing, for example, a working LDM. These Docker images can subsequently be run by =docker= command line tools, or =docker-compose= commands that rely on a =docker-compose.yml= file. A =docker-compose.yml= file is a text file that captures exactly how one or more containers run including directory mappings (from outside to within the container), port mappings (from outside to within the container), and other information.

*** =TDSConfig= 

The =TDSConfig= repository is a project that captures THREDDS and LDM configuration files (e.g., =catalog.xml=, =pqact.conf=) for the TDS at [[http://thredds.ucar.edu]]. Specifically, these TDS and LDM configurations were meant to work in harmony with one another. We can re-use this configuration with some minor adjustments for running the TDS on the Azure cloud.

** =git clone= Repositories

With that background information out of the way, let's clone those repositories by creating =~/git= directory where our repositories will live and issuing some =git= commands.

#+BEGIN_SRC sh :results silent
  mkdir -p /home/ubuntu/git
  git clone https://github.com/Unidata/Unidata-Dockerfiles \
      /home/ubuntu/git/Unidata-Dockerfiles
  git clone https://github.com/Unidata/TdsConfig /home/ubuntu/git/TdsConfig
#+END_SRC

** Configuring the LDM
*** LDM Directories on Docker Host

For anyone who has worked with the LDM, you may be familiar with the following directories:

#+BEGIN_EXAMPLE
etc/
var/data
var/logs
var/queue
#+END_EXAMPLE

The LDM =etc= directory is where you will find configuration files related to the LDM including =ldmd.conf=, =pqact= files, =registry.xml=, and  =scour.conf=. We will need the ability to easily observe and manipulate the files from *outside* the running LDM container. To that end, we need to find a home for =etc= on the Docker host. The same is true for the =var/data= and =var/logs= directories. Later, we will use Docker commands that have been written on your behalf to mount these directories from *outside* to within the container. The =var/queues= directory will remain inside the container.

#+BEGIN_SRC sh  :results silent
  mkdir -p ~/var/logs 
  mkdir -p ~/etc/TDS
#+END_SRC

=var/data= is a bit different in that it needs to be mounted on data volume on the Docker host. We will be handling that step further on.

