ams2016/README/README.tex

\subsection{Add \texttt{ubuntu} User to \texttt{docker} Group and Restart Docker}
\label{sec:orgheadline7}

\begin{verbatim}
sudo usermod -G docker ubuntu
sudo service docker restart
\end{verbatim}

\subsection{Restart Azure VM}
\label{sec:orgheadline8}

At this point, we want to restart the VM to get a fresh start. This command may take a little while\ldots{}

\begin{verbatim}
docker-machine restart unidata-server
eval "$(docker-machine env unidata-server)"
\end{verbatim}

\subsection{\texttt{ssh} into VM}
\label{sec:orgheadline9}

\begin{verbatim}
docker-machine ssh unidata-server
\end{verbatim}

\subsection{Install \texttt{docker-compose} on VM}
\label{sec:orgheadline10}

\texttt{docker-compose} is a tool for defining and running multi-container Docker applications. In our case, we will be running the LDM, TDS, TDM (THREDDS Data Manager) and RAMADDA so \texttt{docker-compose} is perfect for this scenario. Install \texttt{docker-compose} on the Azure Docker host.

"You may have to update version (currently at \texttt{1.5.2}).

\begin{verbatim}
 curl -L \
https://github.com/docker/compose/releases/download/1.5.2/docker-compose-`uname -s`-`uname -m` \
      > docker-compose
 sudo mv docker-compose /usr/local/bin/
 sudo chmod +x /usr/local/bin/docker-compose
\end{verbatim}

\section{LDM and TDS Configuration}
\label{sec:orgheadline27}
\subsection{Background}
\label{sec:orgheadline14}

At this point, we have done the preliminary legwork to tackle the next step in this process. We will now want to clone two repositories that will allow us to configure and start running the the LDM, TDS, and RAMADDA. In particular, we will be cloning:

\begin{itemize}
\item \href{https://github.com/Unidata/Unidata-Dockerfiles}{\texttt{github.com/Unidata/Unidata-Dockerfiles}}
\item \href{https://github.com/Unidata/TdsConfig}{\texttt{github.com/Unidata/TdsConfig}}
\end{itemize}

\subsubsection{\texttt{Unidata-Dockerfiles}}
\label{sec:orgheadline12}

The \texttt{Unidata-Dockerfiles} repository contains a number of Dockerfiles that pertain to various Unidata technologies (e.g., the LDM) and also projects (e.g., ams2016). As a matter of background information, a \texttt{Dockerfile} is a text file that contains commands to build a Docker image containing, for example, a working LDM. These Docker images can subsequently be run by \texttt{docker} command line tools, or \texttt{docker-compose} commands that rely on a \texttt{docker-compose.yml} file. A \texttt{docker-compose.yml} file is a text file that captures exactly how one or more containers run including directory mappings (from outside to within the container), port mappings (from outside to within the container), and other information.

\subsubsection{\texttt{TDSConfig}}
\label{sec:orgheadline13}

The \texttt{TDSConfig} repository is a project that captures THREDDS and LDM configuration files (e.g., \texttt{catalog.xml}, \texttt{pqact.conf}) for the TDS at \url{http://thredds.ucar.edu}. Specifically, these TDS and LDM configurations were meant to work in harmony with one another. We can re-use this configuration with some minor adjustments for running the TDS on the Azure cloud.

\subsection{\texttt{git clone} Repositories}
\label{sec:orgheadline15}

With that background information out of the way, let's clone those repositories by creating \texttt{\textasciitilde{}/git} directory where our repositories will live and issuing some \texttt{git} commands.

\begin{verbatim}
mkdir -p /home/ubuntu/git
git clone https://github.com/Unidata/Unidata-Dockerfiles \
    /home/ubuntu/git/Unidata-Dockerfiles
git clone https://github.com/Unidata/TdsConfig /home/ubuntu/git/TdsConfig
\end{verbatim}

\subsection{Configuring the LDM}
\label{sec:orgheadline24}
\subsubsection{LDM Directories on Docker Host}
\label{sec:orgheadline16}

For anyone who has worked with the LDM, you may be familiar with the following directories:

\begin{verbatim}
etc/
var/data
var/logs
var/queue
\end{verbatim}

The LDM \texttt{etc} directory is where you will find configuration files related to the LDM including \texttt{ldmd.conf}, \texttt{pqact} files, \texttt{registry.xml}, and  \texttt{scour.conf}. We will need the ability to easily observe and manipulate the files from \textbf{outside} the running LDM container. To that end, we need to find a home for \texttt{etc} on the Docker host. The same is true for the \texttt{var/data} and \texttt{var/logs} directories. Later, we will use Docker commands that have been written on your behalf to mount these directories from \textbf{outside} to within the container. The \texttt{var/queues} directory will remain inside the container.

\begin{verbatim}
mkdir -p ~/var/logs 
mkdir -p ~/etc/TDS
\end{verbatim}

\texttt{var/data} is a bit different in that it needs to be mounted on data volume on the Docker host. We will be handling that step further on.
