ams2016/README/README.tex

\subsubsection{LDM Configuration Files}
\label{sec:orgheadline22}

There is a generic set of LDM configuration files located here \texttt{\textasciitilde{}/git/Unidata-Dockerfiles/ldm/etc/}. However, we will just grab \texttt{netcheck.conf} which will remain unmodified.

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ldm/etc/netcheck.conf ~/etc
\end{verbatim}

The rest of the LDM configuration files will come from our \texttt{ams2016} project directory.

Also, remember that these files will be used \textbf{inside} the LDM container that we will set up shortly. We will now be working with these files:

\begin{itemize}
\item \texttt{ldmd.conf}
\item \texttt{registry.xml}
\item \texttt{scour.conf}
\end{itemize}

\begin{enumerate}
\item \texttt{ldmd.conf}
\label{sec:orgheadline17}

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ams2016/ldmd.conf ~/etc/
\end{verbatim}

This \texttt{ldmd.conf} has been setup for the AMS 2016 demonstration serving the following data feeds:
\begin{itemize}
\item \href{http://rapidrefresh.noaa.gov/}{13km Rapid Refresh}
\end{itemize}

In addition, there is a \texttt{\textasciitilde{}/git/TdConfig/idd/pqacts/README.txt} file that may be helpful in writing a suitable \texttt{ldmd.conf} file.

\item \texttt{registry.xml}
\label{sec:orgheadline18}

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ams2016/registry.xml ~/etc/
\end{verbatim}

This file has been set up for the AMS 2016 demonstration. Otherwise you would have to edit the \texttt{registry.xml} to ensure the \texttt{hostname} element is correct. For your own cloud VMs, work with \texttt{support-idd@unidata.ucar.edu} to devise a correct \texttt{hostname} element so that LDM statistics get properly reported. Here is an example \texttt{hostname} element \texttt{unidata-server.azure.unidata.ucar.edu}.

\item \texttt{scour.conf}
\label{sec:orgheadline19}

You need to scour data or else your disk will full up. The crontab entry that runs scour is in the \href{https://github.com/Unidata/Unidata-Dockerfiles/blob/master/ldm/crontab}{LDM Docker container}. Scouring is invoked once per day.

\begin{verbatim}
cp ~/git/Unidata-Dockerfiles/ams2016/scour.conf ~/etc/
\end{verbatim}

\item \texttt{pqact.conf} and TDS configuration
\label{sec:orgheadline20}

In the \texttt{ldmd.conf} file we copied just a moment ago there is a reference to a \texttt{pqact} file; \texttt{etc/TDS/pqact.forecastModels}. We need to ensure that file exists by doing the following instructions. Specifically, explode \texttt{\textasciitilde{}/git/TdsConfig/idd/config.zip} into \texttt{\textasciitilde{}/tdsconfig} and \texttt{cp -r} the \texttt{pqacts} directory into \texttt{\textasciitilde{}/etc/TDS}. \textbf{Note} do NOT use soft links. Docker does not like them.

\begin{verbatim}
mkdir -p ~/tdsconfig/
cp ~/git/tdsConfig/idd/config.zip ~/tdsconfig/
unzip ~/tdsconfig/config.zip -d ~/tdsconfig/
cp -r ~/tdsconfig/pqacts/* ~/etc/TDS
\end{verbatim}

\item Edit \texttt{ldmfile.sh}
\label{sec:orgheadline21}

As the top of this file indicates, you must edit the \texttt{logfile} to suit your needs. Change the 

\begin{verbatim}
logfile=logs/ldm-mcidas.log
\end{verbatim}

line to

\begin{verbatim}
logfile=var/logs/ldm-mcidas.log
\end{verbatim}

This will ensure \texttt{ldmfile.sh} can properly invoked from the \texttt{pqact} files.
\end{enumerate}

\subsubsection{Upstream Data Feed from Unidata or Elsewhere}
\label{sec:orgheadline23}

The LDM operates on a push data model. You will have to find someone who will agree to push you the data. If you are part of the American academic community please send a support email to \texttt{support-idd@unidata.ucar.edu} to discuss your LDM data requirements.

\subsection{Configuring the TDS}
\label{sec:orgheadline26}
\subsubsection{Edit TDS catalog.xml Files}
\label{sec:orgheadline25}

The \texttt{catalog.xml} files for TDS configuration are contained within the \texttt{\textasciitilde{}/tdsconfig} directory. Search for all files terminating in \texttt{.xml} in that directory. Edit the xml files for what data you wish to server. See the \href{http://www.unidata.ucar.edu/software/thredds/current/tds/catalog/index.html}{TDS Documentation} for more information on editing these XML files.

Let's see what is available in the \texttt{\textasciitilde{}/tdsconfig} directory.

\begin{verbatim}
find ~/tdsconfig -type f -name "*.xml"
\end{verbatim}

\begin{verbatim}
/home/ubuntu/tdsconfig/idd/forecastModels.xml
/home/ubuntu/tdsconfig/idd/radars.xml
/home/ubuntu/tdsconfig/idd/obsData.xml
/home/ubuntu/tdsconfig/idd/forecastProdsAndAna.xml
/home/ubuntu/tdsconfig/idd/satellite.xml
/home/ubuntu/tdsconfig/radar/CS039_L2_stations.xml
/home/ubuntu/tdsconfig/radar/CS039_stations.xml
/home/ubuntu/tdsconfig/radar/RadarNexradStations.xml
/home/ubuntu/tdsconfig/radar/RadarTerminalStations.xml
/home/ubuntu/tdsconfig/radar/RadarL2Stations.xml
/home/ubuntu/tdsconfig/radar/radarCollections.xml
/home/ubuntu/tdsconfig/catalog.xml
/home/ubuntu/tdsconfig/threddsConfig.xml
/home/ubuntu/tdsconfig/wmsConfig.xml
\end{verbatim}

\section{Setting up Data Volumes}
\label{sec:orgheadline30}

As alluded to earlier, we will have to set up data volumes so that the LDM can
write data, and the TDS and RAMADDA can have access to that data. The \texttt{/mnt}
volume on Azure is a good place to store data. Check with Azure about the
assurances Azure makes about the reliability of storing your data there for the
long term. For the LDM this should not be too much of a problem, but for RAMADDA
you may wish to be careful.
