ams2016/README/README.md

### LDM Configuration Files<a id="orgheadline22"></a>

There is a generic set of LDM configuration files located here `~/git/Unidata-Dockerfiles/ldm/etc/`. However, we will just grab `netcheck.conf` which will remain unmodified.

    cp ~/git/Unidata-Dockerfiles/ldm/etc/netcheck.conf ~/etc

The rest of the LDM configuration files will come from our `ams2016` project directory.

Also, remember that these files will be used **inside** the LDM container that we will set up shortly. We will now be working with these files:

-   `ldmd.conf`
-   `registry.xml`
-   `scour.conf`

1.  `ldmd.conf`

        cp ~/git/Unidata-Dockerfiles/ams2016/ldmd.conf ~/etc/
    
    This `ldmd.conf` has been setup for the AMS 2016 demonstration serving the following data feeds:
    
    -   [13km Rapid Refresh](http://rapidrefresh.noaa.gov/)
    -   [NESDIS GOES Satellite Data](http://www.nesdis.noaa.gov/imagery_data.html)
    -   Unidata NEXRAD Composites
    
    In addition, there is a `~/git/TdConfig/idd/pqacts/README.txt` file that may be helpful in writing a suitable `ldmd.conf` file.

2.  `registry.xml`

        cp ~/git/Unidata-Dockerfiles/ams2016/registry.xml ~/etc/
    
    This file has been set up for the AMS 2016 demonstration. Otherwise you would have to edit the `registry.xml` to ensure the `hostname` element is correct. For your own cloud VMs, work with `support-idd@unidata.ucar.edu` to devise a correct `hostname` element so that LDM statistics get properly reported. Here is an example `hostname` element `unidata-server.azure.unidata.ucar.edu`.

3.  `scour.conf`

    You need to scour data or else your disk will full up. The crontab entry that runs scour is in the [LDM Docker container](https://github.com/Unidata/Unidata-Dockerfiles/blob/master/ldm/crontab). Scouring is invoked once per day.
    
        cp ~/git/Unidata-Dockerfiles/ams2016/scour.conf ~/etc/

4.  `pqact.conf` and TDS configuration

    In the `ldmd.conf` file we copied just a moment ago there is a reference to a `pqact` file; `etc/TDS/pqact.forecastModels`. We need to ensure that file exists by doing the following instructions. Specifically, explode `~/git/TdsConfig/idd/config.zip` into `~/tdsconfig` and `cp -r` the `pqacts` directory into `~/etc/TDS`. **Note** do NOT use soft links. Docker does not like them.
    
        mkdir -p ~/tdsconfig/
        cp ~/git/TdsConfig/idd/config.zip ~/tdsconfig/
        unzip ~/tdsconfig/config.zip -d ~/tdsconfig/
        cp -r ~/tdsconfig/pqacts/* ~/etc/TDS

5.  Edit `ldmfile.sh`

    As the top of this file indicates, you must edit the `logfile` to suit your needs. Change the 
    
        logfile=logs/ldm-mcidas.log
    
    line to
    
        logfile=var/logs/ldm-mcidas.log
    
    This will ensure `ldmfile.sh` can properly invoked from the `pqact` files.

### Upstream Data Feed from Unidata or Elsewhere<a id="orgheadline23"></a>

The LDM operates on a push data model. You will have to find someone who will agree to push you the data. If you are part of the American academic community please send a support email to `support-idd@unidata.ucar.edu` to discuss your LDM data requirements.

## Configuring the TDS<a id="orgheadline26"></a>

### Edit TDS catalog.xml Files<a id="orgheadline25"></a>

The `catalog.xml` files for TDS configuration are contained within the `~/tdsconfig` directory. Search for all files terminating in `.xml` in that directory. Edit the xml files for what data you wish to server. See the [TDS Documentation](http://www.unidata.ucar.edu/software/thredds/current/tds/catalog/index.html) for more information on editing these XML files.

Let's see what is available in the `~/tdsconfig` directory.

    find ~/tdsconfig -type f -name "*.xml"

    /home/ubuntu/tdsconfig/idd/forecastModels.xml
    /home/ubuntu/tdsconfig/idd/radars.xml
    /home/ubuntu/tdsconfig/idd/obsData.xml
    /home/ubuntu/tdsconfig/idd/forecastProdsAndAna.xml
    /home/ubuntu/tdsconfig/idd/satellite.xml
    /home/ubuntu/tdsconfig/radar/CS039_L2_stations.xml
    /home/ubuntu/tdsconfig/radar/CS039_stations.xml
    /home/ubuntu/tdsconfig/radar/RadarNexradStations.xml
    /home/ubuntu/tdsconfig/radar/RadarTerminalStations.xml
    /home/ubuntu/tdsconfig/radar/RadarL2Stations.xml
    /home/ubuntu/tdsconfig/radar/radarCollections.xml
    /home/ubuntu/tdsconfig/catalog.xml
    /home/ubuntu/tdsconfig/threddsConfig.xml
    /home/ubuntu/tdsconfig/wmsConfig.xml

# Setting up Data Volumes<a id="orgheadline30"></a>

As alluded to earlier, we will have to set up data volumes so that the LDM can
write data, and the TDS and RAMADDA can have access to that data. The `/mnt`
volume on Azure is a good place to store data. Check with Azure about the
assurances Azure makes about the reliability of storing your data there for the
long term. For the LDM this should not be too much of a problem, but for RAMADDA
you may wish to be careful.
