ams2016/README/README.org
** Check Free Disk Space

Let's first display the free disk space with the =df= command. 

#+BEGIN_SRC sh :results table drawer :exports both
  df -H
#+END_SRC

#+RESULTS:
:RESULTS:
| Filesystem | Size | Used | Avail | Use% | Mounted                           | on |
| /dev/sda1  | 31G  | 1.8G | 28G   |   6% | /                                 |    |
| none       | 4.1k |    0 | 4.1k  |   0% | /sys/fs/cgroup                    |    |
| udev       | 7.4G |  13k | 7.4G  |   1% | /dev                              |    |
| tmpfs      | 1.5G | 394k | 1.5G  |   1% | /run                              |    |
| none       | 5.3M |    0 | 5.3M  |   0% | /run/lock                         |    |
| none       | 7.4G |    0 | 7.4G  |   0% | /run/shm                          |    |
| none       | 105M |    0 | 105M  |   0% | /run/user                         |    |
| none       | 66k  |    0 | 66k   |   0% | /etc/network/interfaces.dynamic.d |    |
| /dev/sdb1  | 640G |  73M | 607G  |   1% | /mnt                              |    |
:END:

** Create =/data= Directory

Create a =/data= directory where the LDM can write data soft link to the =/mnt= directory. Also, create a =/repository= directory where RAMADDA data will reside.

#+BEGIN_SRC sh :results silent
  sudo ln -s /mnt /data
  sudo mkdir /mnt/ldm/
  sudo chown -R ubuntu:docker /data/ldm
  sudo mkdir /mnt/repository/
  sudo chown -R ubuntu:docker /data/repository
#+END_SRC

These directories will be used by the LDM, TDS, and RAMADDA docker containers when we mount diretories from the Docker host into these containers.

* Opening Ports 

Ensure these ports are open on the VM where these containers will run. Ask the cloud administrator for these ports to be open.

|---------+---------------|
| Service | External Port |
|---------+---------------|
| HTTP    |            80 |
| TDS     |          8080 |
| RAMADDA |          8081 |
| SSL TDM |          8443 |
| LDM     |           388 |
|---------+---------------|

Note the TDM is an application that works in conjuction with the TDS. It creates indexes for GRIB data in the background, and notifies the TDS via port 8443 when data have been updated or changed. See [[https://www.unidata.ucar.edu/software/thredds/current/tds/reference/collections/TDM.html][here]] to learn more about the TDM.

* Tomcat Logging for TDS and RAMADDA

It is a good idea to mount Tomcat logging directories outside the container so that they can be managed for both the TDS and RAMADDA.

#+BEGIN_SRC sh :results silent
  mkdir -p ~/logs/ramadda-tomcat
  mkdir -p ~/logs/tds-tomcat
#+END_SRC

Note there is also a logging directory in =~/tdsconfig/logs=. All these logging directories should be looked at periodically, not the least to ensure that log files are not filling up your system.

* Starting the LDM TDS RAMADDA TDM
*** RAMADDA Preconfiguration

  When you start RAMADDA for the very first time, you must have  a =password.properties= file in the RAMADDA home directory which is =/data/repository/=. See [[http://ramadda.org//repository/userguide/toc.html][RAMADDA documentation]] for more details on setting up RAMADDA. Here is a =pw.properties= file to get you going. Change password below to something more secure!

  #+BEGIN_SRC sh :results silent
    echo ramadda.install.password=changeme! > /data/repository/pw.properties
  #+END_SRC

*** Final Edit to =docker-compose.yml=

When the TDM communicates to the TDS concering changes in data it observes with data supplied by the LDM, it will communicate via the =tdm= tomcat user. Edit the =docker-compose.yml= file and change the =TDM_PW= to =MeIndexer=. This is not as insecure as it would seem since the tdm user has few priviliges. Optimally, one could change the password hash for the TDM user in the =tomcat-users.xml= file.

#+BEGIN_SRC emacs-lisp :exports none :results silent :noweb yes
  ;; search for the buffer called docker-compose.yml in your emacs session
  (find-file "/ubuntu@<<myvm>>:/home/ubuntu/git/Unidata-Dockerfiles/ams2016/docker-compose.yml")
#+END_SRC

*** Pull Down Images from the DockerHub Registry

At this point you are almost ready to run the whole kit and caboodle. But first  pull the relevant docker images to make this easier for the subequent =docker-compose= command.

# Run this command directly on remote host; it takes too long.

#+BEGIN_SRC sh :results silent :eval no
  docker pull unidata/ldmtds:latest
  docker pull unidata/tdm:latest
  docker pull unidata/tds:latest
  docker pull unidata/ramadda:latest
#+END_SRC

*** Start the LDM, TDS, TDM, RAMADDA

We are now finally ready to start the LDM, TDS, TDM, RAMADDA with the following =docker-compose= command.

#+BEGIN_SRC sh :results silent
  docker-compose -f ~/git/Unidata-Dockerfiles/ams2016/docker-compose.yml up -d
#+END_SRC

