ams2016/README/README.tex

\subsection{Check Free Disk Space}
\label{sec:orgheadline28}

Let's first display the free disk space with the \texttt{df} command. 

\begin{verbatim}
df -H
\end{verbatim}

\begin{center}
\begin{tabular}{llrllll}
Filesystem & Size & Used & Avail & Use\% & Mounted & on\\
/dev/sda1 & 31G & 1.8G & 28G & 6\% & / & \\
none & 4.1k & 0 & 4.1k & 0\% & /sys/fs/cgroup & \\
udev & 7.4G & 13k & 7.4G & 1\% & /dev & \\
tmpfs & 1.5G & 394k & 1.5G & 1\% & /run & \\
none & 5.3M & 0 & 5.3M & 0\% & /run/lock & \\
none & 7.4G & 0 & 7.4G & 0\% & /run/shm & \\
none & 105M & 0 & 105M & 0\% & /run/user & \\
none & 66k & 0 & 66k & 0\% & /etc/network/interfaces.dynamic.d & \\
/dev/sdb1 & 640G & 73M & 607G & 1\% & /mnt & \\
\end{tabular}
\end{center}

\subsection{Create \texttt{/data} Directory}
\label{sec:orgheadline29}

Create a \texttt{/data} directory where the LDM can write data soft link to the \texttt{/mnt} directory. Also, create a \texttt{/repository} directory where RAMADDA data will reside.

\begin{verbatim}
sudo ln -s /mnt /data
sudo mkdir /mnt/ldm/
sudo chown -R ubuntu:docker /data/ldm
sudo mkdir /mnt/repository/
sudo chown -R ubuntu:docker /data/repository
\end{verbatim}

These directories will be used by the LDM, TDS, and RAMADDA docker containers when we mount diretories from the Docker host into these containers.

\section{Opening Ports}
\label{sec:orgheadline31}

Ensure these ports are open on the VM where these containers will run. Ask the cloud administrator for these ports to be open.

\begin{center}
\begin{tabular}{lr}
\hline
Service & External Port\\
\hline
HTTP & 80\\
TDS & 8080\\
RAMADDA & 8081\\
SSL TDM & 8443\\
LDM & 388\\
\hline
\end{tabular}
\end{center}

Note the TDM is an application that works in conjunction with the TDS. It creates indexes for GRIB data in the background, and notifies the TDS via port 8443 when data have been updated or changed. See \href{https://www.unidata.ucar.edu/software/thredds/current/tds/reference/collections/TDM.html}{here} to learn more about the TDM.

\section{Tomcat Logging for TDS and RAMADDA}
\label{sec:orgheadline32}

It is a good idea to mount Tomcat logging directories outside the container so that they can be managed for both the TDS and RAMADDA.

\begin{verbatim}
mkdir -p ~/logs/ramadda-tomcat
mkdir -p ~/logs/tds-tomcat
\end{verbatim}

Note there is also a logging directory in \texttt{\textasciitilde{}/tdsconfig/logs}. All these logging directories should be looked at periodically, not the least to ensure that log files are not filling up your system.

\section{Starting the LDM TDS RAMADDA TDM}
\label{sec:orgheadline37}
\subsubsection{RAMADDA Preconfiguration}
\label{sec:orgheadline33}

When you start RAMADDA for the very first time, you must have  a \texttt{password.properties} file in the RAMADDA home directory which is \texttt{/data/repository/}. See \href{http://ramadda.org//repository/userguide/toc.html}{RAMADDA documentation} for more details on setting up RAMADDA. Here is a \texttt{pw.properties} file to get you going. Change password below to something more secure!

\begin{verbatim}
echo ramadda.install.password=changeme! > /data/repository/pw.properties
\end{verbatim}

\subsubsection{Final Edit to \texttt{docker-compose.yml}}
\label{sec:orgheadline34}

When the TDM communicates to the TDS concerning changes in data it observes with data supplied by the LDM, it will communicate via the \texttt{tdm} tomcat user. Edit the \texttt{docker-compose.yml} file and change the \texttt{TDM\_PW} to \texttt{MeIndexer}. This is not as insecure as it would seem since the tdm user has few privileges. Optimally, one could change the password hash for the TDM user in the \texttt{tomcat-users.xml} file.

\subsubsection{Pull Down Images from the DockerHub Registry}
\label{sec:orgheadline35}

At this point you are almost ready to run the whole kit and caboodle. But first  pull the relevant docker images to make this easier for the subsequent \texttt{docker-compose} command.


\begin{verbatim}
docker pull unidata/ldmtds:latest
docker pull unidata/tdm:latest
docker pull unidata/tds:latest
docker pull unidata/ramadda:latest
\end{verbatim}

\subsubsection{Start the LDM, TDS, TDM, RAMADDA}
\label{sec:orgheadline36}

We are now finally ready to start the LDM, TDS, TDM, RAMADDA with the following \texttt{docker-compose} command.

\begin{verbatim}
docker-compose -f ~/git/Unidata-Dockerfiles/ams2016/docker-compose.yml up -d
\end{verbatim}
