ams2016/README/README.org
* Check What is Running 

At this point, you should have these services running:

- LDM
- TDS
- TDM
- RAMADDA

Next, we will check our work through various means.

** Docker Process Status 

From the shell where you started =docker-machine= earlier you can execute the following =docker ps= command to list the containers on your docker host. It should look something like the output below.

#+BEGIN_SRC sh :results table drawer  :exports both
  docker ps --format "table {{.ID}}\t{{.Image}}\t{{.Status}}"
#+END_SRC

#+RESULTS:
:RESULTS:
| CONTAINER    | ID                     | IMAGE | STATUS |      |
| 32d3b20c8329 | unidata/ramadda:latest | Up    |      5 | days |
| 594577bb15b9 | unidata/ldmtds:latest  | Up    |      5 | days |
| d86a3d33216f | unidata/tdm:latest     | Up    |      5 | days |
| 69fc06217d86 | unidata/tds:latest     | Up    |      5 | days |
:END:

** TDS and RAMADDA URLs

#+BEGIN_SRC org :noweb yes :results append :exports results
  Verify what you have the TDS and RAMADDA running by navigating to: [[http://<<myvm>>.cloudapp.net/thredds/catalog.html]] and [[http://<<myvm>>.cloudapp.net:8081/repository]]. If you are going to RAMADDA for the first time, you will have to do some [[http://ramadda.org//repository/userguide/toc.html][RAMADDA set up]].
#+END_SRC

#+RESULTS:
Verify what you have the TDS and RAMADDA running by navigating to: [[http://unidata-server.cloudapp.net/thredds/catalog.html]] and [[http://unidata-server.cloudapp.net:8081/repository]]. If you are going to RAMADDA for the first time, you will have to do some [[http://ramadda.org//repository/userguide/toc.html][RAMADDA set up]].

**  Viewing Data with the IDV 

Another way to verify your work is run the [[https://www.unidata.ucar.edu/software/idv/][Unidata Integrated Data Viewer]].

*** Access TDS with the IDV

#+BEGIN_SRC org :noweb yes :results append :exports results
  In the [[https://www.unidata.ucar.edu/software/idv/docs/userguide/data/choosers/CatalogChooser.html][IDV Dashboard]], you should be able to enter the catalog XML URL: [[http://<<myvm>>.cloudapp.net/thredds/catalog.xml]].  
#+END_SRC

#+RESULTS:
In the [[https://www.unidata.ucar.edu/software/idv/docs/userguide/data/choosers/CatalogChooser.html][IDV Dashboard]], you should be able to enter the catalog XML URL: [[http://unidata-server.cloudapp.net/thredds/catalog.xml]].  

*** Acess RAMADDAA with the IDV

#+BEGIN_SRC org :noweb yes :results append :exports results
RAMADDA has good integration with the IDV and the two technolgies work well together. You may wish to install the [[http://www.unidata.ucar.edu/software/idv/docs/workshop/savingstate/Ramadda.html][RAMADDA IDV plugin]] to publish IDV bundles to RAMADDA. RAMADDA also has access to the =/data/ldm= directory so you may want to set up [[http://ramadda.org//repository/userguide/developer/filesystem.html][server-side view of this part of the file system]]. Finally,  you can enter this catlog URL in the IDV dashbaord to examine data holdings shared bundles, etc. on RAMADDA [[http://unidata-server-2.cloudapp.net:8081/repository?output=thredds.catalog]].
#+END_SRC

#+RESULTS:
RAMADDA has good integration with the IDV and the two technolgies work well together. You may wish to install the [[http://www.unidata.ucar.edu/software/idv/docs/workshop/savingstate/Ramadda.html][RAMADDA IDV plugin]] to publish IDV bundles to RAMADDA. RAMADDA also has access to the =/data/ldm= directory so you may want to set up [[http://ramadda.org//repository/userguide/developer/filesystem.html][server-side view of this part of the file system]]. Finally,  you can enter this catlog URL in the IDV dashbaord to examine data holdings shared bundles, etc. on RAMADDA [[http://unidata-server-2.cloudapp.net:8081/repository?output=thredds.catalog]].


