ams2016/README/README.tex

\section{Check What is Running}
\label{sec:orgheadline43}

At this point, you should have these services running:

\begin{itemize}
\item LDM
\item TDS
\item TDM
\item RAMADDA
\end{itemize}

Next, we will check our work through various means.

\subsection{Docker Process Status}
\label{sec:orgheadline38}

From the shell where you started \texttt{docker-machine} earlier you can execute the following \texttt{docker ps} command to list the containers on your docker host. It should look something like the output below.

\begin{verbatim}
docker ps --format "table {{.ID}}\t{{.Image}}\t{{.Status}}"
\end{verbatim}

\begin{center}
\begin{tabular}{lllrl}
CONTAINER & ID & IMAGE & STATUS & \\
32d3b20c8329 & unidata/ramadda:latest & Up & 5 & days\\
594577bb15b9 & unidata/ldmtds:latest & Up & 5 & days\\
d86a3d33216f & unidata/tdm:latest & Up & 5 & days\\
69fc06217d86 & unidata/tds:latest & Up & 5 & days\\
\end{tabular}
\end{center}

\subsection{TDS and RAMADDA URLs}
\label{sec:orgheadline39}

Verify what you have the TDS and RAMADDA running by navigating to: \url{http://unidata-server.cloudapp.net/thredds/catalog.html} and \url{http://unidata-server.cloudapp.net:8081/repository}. If you are going to RAMADDA for the first time, you will have to do some \href{http://ramadda.org//repository/userguide/toc.html}{RAMADDA set up}.

\subsection{Viewing Data with the IDV}
\label{sec:orgheadline42}

Another way to verify your work is run the \href{https://www.unidata.ucar.edu/software/idv/}{Unidata Integrated Data Viewer}.

\subsubsection{Access TDS with the IDV}
\label{sec:orgheadline40}

In the \href{https://www.unidata.ucar.edu/software/idv/docs/userguide/data/choosers/CatalogChooser.html}{IDV Dashboard}, you should be able to enter the catalog XML URL: \url{http://unidata-server.cloudapp.net/thredds/catalog.xml}.  

\subsubsection{Access RAMADDAA with the IDV}
\label{sec:orgheadline41}

RAMADDA has good integration with the IDV and the two technologies work well together. You may wish to install the \href{http://www.unidata.ucar.edu/software/idv/docs/workshop/savingstate/Ramadda.html}{RAMADDA IDV plugin} to publish IDV bundles to RAMADDA. RAMADDA also has access to the \texttt{/data/ldm} directory so you may want to set up \href{http://ramadda.org//repository/userguide/developer/filesystem.html}{server-side view of this part of the file system}. Finally,  you can enter this catalog URL in the IDV dashboard to examine data holdings shared bundles, etc. on RAMADDA \url{http://unidata-server.cloudapp.net:8081/repository?output=thredds.catalog}.
\end{document}
